{
  "id": "travel-pace-slow",
  "name": "Slow Pace",
  "description": "A cautious and observant travel pace that allows characters to be more aware of their surroundings and move stealthily. While traveling at a slow pace, characters move carefully, watching for danger and being mindful of their environment. This pace is ideal for dangerous territory, when searching for something, or when stealth is important.",
  "movement": {
    "speedMultiplier": 0.67,
    "perMinute": 200,
    "perHour": 2,
    "perDay": 18,
    "unit": "feet (minute) / miles (hour, day)"
  },
  "effects": {
    "advantageOn": [
      "Wisdom (Perception) checks",
      "Wisdom (Survival) checks"
    ],
    "disadvantageOn": [],
    "stealthPossible": true,
    "stealthAdvantage": false,
    "mechanicalEffects": [
      "Grants Advantage on Wisdom (Perception or Survival) checks",
      "No penalty to Dexterity (Stealth) checks",
      "Allows careful navigation through dangerous areas",
      "Compatible with all terrain types up to the maximum pace allowed"
    ]
  },
  "restrictions": [
    "The group must move at a Slow pace if any group member's Speed is reduced to half or less of normal",
    "Mounts can move at twice the listed distance for 1 hour, after which they need a Short or Long Rest before they can move at that increased pace again"
  ],
  "terrain": {
    "note": "Some terrains limit the maximum pace to Slow (see Travel Terrain table)",
    "difficultTerrain": "Difficult Terrain halves movement speed, which may force a Slow pace or slower"
  },
  "calculations": {
    "formula": "Slow pace = Normal pace × 2/3 (round down)",
    "specialMovement": "For creatures with magical speed, use: Miles per day (Normal) × 2/3 = Slow pace miles per day"
  },
  "srdReference": "data/5e/srd/split/playingthegame/06-Exploration.md",
  "additionalReferences": [
    "data/5e/srd/split/gameplaytoolbox/00-TravelPace.md"
  ],
  "examples": [
    "Traveling through a dungeon corridor while watching for traps",
    "Moving through hostile wilderness while trying to avoid detection",
    "Searching for a hidden location or following subtle tracks",
    "Navigating through swamp terrain (which may require Slow pace)",
    "When a party member is encumbered or has reduced speed"
  ],
  "integration": {
    "foundryVTT": {
      "automation": "Can be used to automatically calculate travel time based on distance",
      "tracking": "Integrates with journey tracking and exploration modes",
      "skillChecks": "Automatically applies Advantage to Perception and Survival checks during travel",
      "journalEntries": "Can reference this pace in travel journal entries and adventure logs"
    },
    "relatedSystems": [
      "travel-mode",
      "travel-activities",
      "exploration-activities",
      "skill-checks"
    ]
  }
}
