{
  "id": "action-attack",
  "name": "Attack",
  "description": "Make one attack roll with a weapon or an Unarmed Strike",
  "type": "action",
  "availability": "any",
  "requirements": [
    "Must have a weapon equipped or be able to make an Unarmed Strike"
  ],
  "effects": {
    "description": "When you take the Attack action, you can make one attack roll with a weapon or an Unarmed Strike. You can equip or unequip one weapon either before or after the attack.",
    "mechanicalEffects": [
      "Make one attack roll against a target within range",
      "On a hit, roll damage dice and add relevant modifiers",
      "Add your ability modifier (Strength for melee, Dexterity for ranged attacks) to the attack roll",
      "Add your Proficiency Bonus if you're proficient with the weapon",
      "Critical Hit on natural 20: roll damage dice twice",
      "Automatic miss on natural 1"
    ]
  },
  "restrictions": [
    "You can only make one attack unless you have a feature like Extra Attack",
    "You can equip or unequip only one weapon as part of this action",
    "Movement between attacks is allowed if you have features that grant multiple attacks"
  ],
  "srdReference": "dndsrd5.2_markdown/src/08_RulesGlossary.md:115-122",
  "examples": [
    "A fighter swings their longsword at an orc",
    "A ranger fires an arrow at a distant target",
    "A monk makes an unarmed strike with a punch",
    "A rogue draws a dagger and stabs at an enemy in one fluid motion"
  ],
  "relatedActions": [
    "action-ready",
    "action-grapple",
    "action-shove"
  ],
  "additionalRules": {
    "equipUnequip": "You can either equip or unequip one weapon when you make an attack as part of this action. You do so either before or after the attack. If you equip a weapon before an attack, you don't need to use it for that attack.",
    "movingBetweenAttacks": "If you move on your turn and have a feature, such as Extra Attack, that gives you more than one attack as part of the Attack action, you can use some or all of that movement to move between those attacks.",
    "attackRoll": "An attack roll is a d20 roll + ability modifier + proficiency bonus (if proficient) + any situational modifiers",
    "targetNumber": "The attack roll must equal or exceed the target's Armor Class (AC) to hit"
  }
}
