{
  "id": "action-cast-spell",
  "name": "Magic (Cast a Spell)",
  "description": "Cast a spell that has a casting time of an action or use a magical feature or magic item",
  "type": "action",
  "availability": "any",
  "requirements": [
    "Must have access to spells through class features, racial traits, or magic items",
    "Must have spell slots available (unless casting a cantrip or ritual)",
    "Must be able to provide required components (Verbal, Somatic, Material)",
    "Cannot be Silenced if spell has Verbal components",
    "Must have hands free if spell has Somatic components"
  ],
  "effects": {
    "description": "When you take the Magic action, you cast a spell that has a casting time of an action or use a feature or magic item that requires a Magic action to be activated. If casting a spell with a longer casting time (1 minute or more), you must take the Magic action on each turn of that casting and maintain Concentration.",
    "mechanicalEffects": [
      "Cast one spell with a casting time of 1 action",
      "Expend a spell slot of appropriate level (if not a cantrip)",
      "Follow all casting requirements (components, range, etc.)",
      "Apply spell effects as described in the spell description",
      "For spells requiring Concentration, maintain focus or the spell ends",
      "For spells with 1 minute or longer casting time, must use Magic action each turn and maintain Concentration"
    ]
  },
  "restrictions": [
    "If you cast a spell as a Bonus Action, you can't cast another spell during the same turn except for a cantrip with a casting time of 1 action",
    "If your Concentration is broken during a long casting time, the spell fails but the spell slot is not expended",
    "Cannot cast spells if you have the Incapacitated condition",
    "Must be able to see the target for most spells (unless spell description says otherwise)"
  ],
  "srdReference": "dndsrd5.2_markdown/src/08_RulesGlossary.md:714-719",
  "examples": [
    "A wizard casts Fireball at a group of enemies",
    "A cleric uses Cure Wounds to heal an injured ally",
    "A warlock activates a magic wand that requires a Magic action",
    "A druid begins a 10-minute ritual, taking the Magic action each turn"
  ],
  "relatedActions": [
    "action-ready",
    "action-utilize"
  ],
  "additionalRules": {
    "concentration": "If a spell requires Concentration, you must maintain it. You lose Concentration if you: (1) start casting another Concentration spell, (2) take damage and fail a Constitution save (DC 10 or half damage, whichever is higher), (3) become Incapacitated, or (4) die.",
    "spellComponents": "V (Verbal) requires you to speak; S (Somatic) requires a free hand for gestures; M (Material) requires specific materials or a spellcasting focus",
    "ritual": "Spells with the Ritual tag can be cast as a ritual (taking 10 minutes longer) without expending a spell slot",
    "cantrips": "Level 0 spells (cantrips) can be cast without expending spell slots",
    "readyingSpells": "When you Ready a spell, you cast it normally (expending resources) but hold its energy. Holding the spell requires Concentration up to the start of your next turn."
  }
}
