{
  "id": "action-dash",
  "name": "Dash",
  "description": "Gain extra movement for the current turn equal to your Speed (after applying modifiers)",
  "type": "action",
  "availability": "any",
  "requirements": [
    "Must have at least 1 foot of Speed remaining"
  ],
  "effects": {
    "description": "When you take the Dash action, you gain extra movement for the current turn. The increase equals your Speed after applying any modifiers.",
    "mechanicalEffects": [
      "Gain additional movement equal to your current Speed",
      "Movement can be used before or after taking the Dash action",
      "If you have special speeds (Fly, Swim, Climb, Burrow), you can use one of those instead of your walking Speed",
      "You choose which speed to use each time you Dash",
      "All normal movement rules apply to the extra movement"
    ]
  },
  "restrictions": [
    "Does not remove movement penalties from Difficult Terrain",
    "Does not prevent Opportunity Attacks",
    "Cannot be used if Speed is reduced to 0",
    "Extra movement must be used during the same turn"
  ],
  "srdReference": "dndsrd5.2_markdown/src/08_RulesGlossary.md:374-379",
  "examples": [
    "A rogue with 30 feet of Speed Dashes to move up to 60 feet total",
    "A character whose Speed is reduced to 15 feet Dashes to move up to 30 feet",
    "A character with a Fly Speed of 60 feet Dashes using their Fly Speed to fly up to 120 feet",
    "A fleeing character uses Dash to quickly escape from combat"
  ],
  "relatedActions": [
    "action-disengage",
    "action-dodge"
  ],
  "additionalRules": {
    "speedCalculation": "With a Speed of 30 feet, you can move up to 60 feet on your turn if you Dash. If your Speed of 30 feet is reduced to 15 feet, you can move up to 30 feet this turn if you Dash.",
    "specialSpeeds": "If you have a special speed, such as a Fly Speed or Swim Speed, you can use that speed instead of your Speed when you take this action. You choose which speed to use each time you take it.",
    "bonusAction": "Some class features (like Rogue's Cunning Action) allow you to Dash as a Bonus Action",
    "mountedCombat": "A controlled mount can use the Dash action on your turn as you direct it"
  }
}
