{
  "id": "action-dodge",
  "name": "Dodge",
  "description": "Focus entirely on avoiding attacks, imposing Disadvantage on attack rolls against you and granting you Advantage on Dexterity saving throws",
  "type": "action",
  "availability": "any",
  "requirements": [
    "Must be able to see the attacker to impose Disadvantage on their attack rolls",
    "Must not have the Incapacitated condition",
    "Must not have 0 Speed"
  ],
  "effects": {
    "description": "If you take the Dodge action, you gain the following benefits: until the start of your next turn, any attack roll made against you has Disadvantage if you can see the attacker, and you make Dexterity saving throws with Advantage.",
    "mechanicalEffects": [
      "Attack rolls against you have Disadvantage (if you can see the attacker)",
      "You make Dexterity saving throws with Advantage",
      "Benefits last until the start of your next turn",
      "You lose these benefits if you gain the Incapacitated condition or if your Speed becomes 0"
    ]
  },
  "restrictions": [
    "You must be able to see the attacker for them to have Disadvantage on attack rolls against you",
    "You lose all benefits if you become Incapacitated",
    "You lose all benefits if your Speed is reduced to 0",
    "Does not provide benefits against attacks you cannot see"
  ],
  "srdReference": "dndsrd5.2_markdown/src/08_RulesGlossary.md:437-442",
  "examples": [
    "A wizard surrounded by enemies uses Dodge to survive until help arrives",
    "A scout takes the Dodge action while retreating from overwhelming odds",
    "A character Dodges while crossing a trapped hallway to better avoid traps",
    "A defender uses Dodge to protect themselves while an ally completes a ritual"
  ],
  "relatedActions": [
    "action-disengage",
    "action-dash"
  ],
  "additionalRules": {
    "vision": "You only impose Disadvantage on attack rolls from attackers you can see. Invisible or hidden attackers do not have Disadvantage.",
    "durationAndLoss": "Benefits last until the start of your next turn. You lose these benefits if you have the Incapacitated condition or if your Speed is 0.",
    "mountedCombat": "A controlled mount can use the Dodge action on your turn as you direct it",
    "combineWithMovement": "You can still use your movement on the same turn you Dodge, allowing you to Dodge and reposition"
  }
}
