{
  "id": "action-influence",
  "name": "Influence",
  "description": "Urge a monster or NPC to do something by making a Charisma or Wisdom check, potentially altering their attitude or behavior",
  "type": "action",
  "availability": "any",
  "requirements": [
    "Must be able to communicate with the target (verbally, through gestures, etc.)",
    "Target must be able to understand you or perceive your communication"
  ],
  "effects": {
    "description": "With the Influence action, you urge a monster to do something. Describe or roleplay how you're communicating with the monster. The GM determines whether the monster feels willing, unwilling, or hesitant, which affects whether an ability check is required.",
    "mechanicalEffects": [
      "If the monster is willing (your request aligns with its desires): no check needed, it complies",
      "If the monster is unwilling (request is repugnant or counter to alignment): no check needed, it refuses",
      "If the monster is hesitant: make an ability check modified by its attitude (Friendly, Indifferent, or Hostile)",
      "DC equals 15 or the monster's Intelligence score, whichever is higher",
      "On success: monster does as urged",
      "On failure: must wait 24 hours (or GM-set duration) before trying the same approach again",
      "Attitude affects the check: Friendly creatures give you Advantage, Hostile creatures impose Disadvantage"
    ]
  },
  "restrictions": [
    "Cannot influence creatures that don't understand any language (unless using Animal Handling)",
    "Some requests may be automatically refused regardless of check result",
    "Failed attempts prevent retrying the same approach for 24 hours",
    "Repeated attempts to influence with different approaches may change the target's attitude negatively"
  ],
  "srdReference": "dndsrd5.2_markdown/src/08_RulesGlossary.md:621-640",
  "examples": [
    "A bard uses Persuasion to convince guards to let the party pass",
    "A warlock uses Intimidation to make bandits flee without a fight",
    "A rogue uses Deception to trick a merchant into revealing information",
    "A ranger uses Animal Handling to calm a hostile bear",
    "A paladin uses Performance to entertain and distract guards"
  ],
  "relatedActions": [
    "action-help",
    "action-search"
  ],
  "additionalRules": {
    "attitudes": {
      "friendly": "A Friendly creature views you favorably. You have Advantage on ability checks to influence a Friendly creature.",
      "indifferent": "An Indifferent creature has no desire to help or hinder you. This is the default attitude of most monsters.",
      "hostile": "A Hostile creature views you unfavorably. You have Disadvantage on ability checks to influence a Hostile creature."
    },
    "influenceChecks": {
      "deception": "Use Charisma (Deception) when deceiving a monster that understands you",
      "intimidation": "Use Charisma (Intimidation) when intimidating a monster",
      "performance": "Use Charisma (Performance) when amusing a monster",
      "persuasion": "Use Charisma (Persuasion) when persuading a monster that understands you",
      "animalHandling": "Use Wisdom (Animal Handling) when gently coaxing a Beast or Monstrosity"
    },
    "changingAttitude": "Successfully influencing a creature might improve its attitude. Failing badly or making unreasonable requests might worsen it. The GM decides when and how attitudes change.",
    "roleplaying": "Roleplaying your influence attempt can grant Advantage or Disadvantage at the GM's discretion. Clever arguments, appropriate bribes, or playing to the target's personality can improve your chances.",
    "combatInfluence": "You can attempt to influence enemies during combat, but most hostile creatures in active combat are unwilling to negotiate. Surrendering enemies or those whose allies have been defeated are more likely to be influenced."
  }
}
