{
  "id": "action-shove",
  "name": "Shove (via Unarmed Strike)",
  "description": "Use an Unarmed Strike to push a creature 5 feet away or knock it prone",
  "type": "action",
  "availability": "any",
  "requirements": [
    "Target must be within 5 feet of you",
    "Target must be no more than one size larger than you",
    "Must use the Attack action and choose the Shove option for your Unarmed Strike"
  ],
  "effects": {
    "description": "When you make an Unarmed Strike and choose the Shove option, the target must succeed on a Strength or Dexterity saving throw (target's choice) or you either push it 5 feet away or cause it to have the Prone condition.",
    "mechanicalEffects": [
      "Target makes a Strength or Dexterity saving throw (DC = 8 + your Strength modifier + your Proficiency Bonus)",
      "On a failed save, you choose one effect:",
      "  - Push the target 5 feet directly away from you",
      "  - Knock the target Prone",
      "Prone condition effects: limited movement (crawl or spend half Speed to stand up); Disadvantage on attack rolls; attack rolls against prone target have Advantage within 5 feet, Disadvantage beyond 5 feet"
    ]
  },
  "restrictions": [
    "Target must be no more than one size larger than you",
    "Can only push target 5 feet away, not in any other direction",
    "If pushing the target into an occupied space or impassable terrain, the shove fails",
    "Cannot shove a target if your Speed is 0"
  ],
  "srdReference": "dndsrd5.2_markdown/src/08_RulesGlossary.md:1082-1093",
  "examples": [
    "A fighter shoves an enemy off a cliff",
    "A barbarian knocks a goblin prone to give allies advantage on attacks",
    "A character shoves an enemy into a trap or hazard",
    "A paladin pushes an enemy away to protect an injured ally"
  ],
  "relatedActions": [
    "action-attack",
    "action-grapple"
  ],
  "additionalRules": {
    "proneCondition": "While Prone: Your only movement options are to crawl or to spend an amount of movement equal to half your Speed (round down) to right yourself and end the condition. If your Speed is 0, you can't right yourself. You have Disadvantage on attack rolls. An attack roll against you has Advantage if the attacker is within 5 feet of you; otherwise, that attack roll has Disadvantage.",
    "pushDirection": "When you successfully shove to push, the target moves 5 feet directly away from you. You cannot push a target into an occupied space or through impassable terrain.",
    "tacticalUses": "Shoving prone is useful to give melee allies Advantage on attacks. Pushing away is useful to move enemies into hazards, off cliffs, or to create distance.",
    "unarmedStrikeOptions": "When making an Unarmed Strike, you choose one option: Damage (1 + Strength modifier bludgeoning damage), Grapple, or Shove",
    "combiningWithMovement": "You can shove an enemy and then use your remaining movement to reposition. Some abilities (like Shield Master feat) allow shoving as a bonus action.",
    "standingUp": "Standing up from Prone costs half your movement (rounded down) and doesn't provoke opportunity attacks"
  }
}
