{
  "id": "hazard-malnutrition",
  "name": "Malnutrition",
  "description": "Creatures that do not consume adequate food suffer exhaustion from starvation",
  "type": "environmental",
  "category": "survival",
  "trigger": "Eating less than half required food for a day, or eating nothing for 5 days",
  "damage": null,
  "savingThrow": {
    "ability": "CON",
    "dc": 10,
    "onSuccess": "No Exhaustion gained (when eating less than half required food)",
    "onFailure": "Gain 1 Exhaustion level at day's end",
    "frequency": "daily"
  },
  "duration": "ongoing until adequate food consumed",
  "effects": {
    "immediate": [],
    "ongoing": [
      "If eating but consuming less than half required food: DC 10 Constitution saving throw or gain 1 Exhaustion level at day's end",
      "If eating nothing for 5 days: automatically gain 1 Exhaustion level at end of fifth day",
      "Each subsequent day without food: automatically gain 1 additional Exhaustion level"
    ],
    "conditions": [
      "exhaustion"
    ]
  },
  "foodRequirements": {
    "tiny": "1/4 pound per day",
    "small": "1 pound per day",
    "medium": "1 pound per day",
    "large": "4 pounds per day",
    "huge": "16 pounds per day",
    "gargantuan": "64 pounds per day"
  },
  "detection": {
    "difficulty": "automatic",
    "method": "track food consumption"
  },
  "mitigation": [
    "Eat at least half the required food amount to have a chance to avoid Exhaustion",
    "Carry adequate food supplies (rations) during travel",
    "Forage for food using Wisdom (Survival) checks",
    "Hunt animals for food",
    "Create food using magic (e.g., Create Food and Water spell, Goodberry spell)",
    "Purchase or trade for food at settlements"
  ],
  "recovery": {
    "requirement": "Exhaustion caused by malnutrition can't be removed until the creature eats the full amount of food required for a day",
    "normalRecovery": "After eating full food requirement, Exhaustion can be removed by Long Rest as normal"
  },
  "srdReference": {
    "file": "dndsrd5.2_markdown/src/08_RulesGlossary.md",
    "section": "Malnutrition [Hazard]",
    "lines": "724-740",
    "quote": "A creature needs an amount of food per day based on its size, as shown in the Food Needs per Day table. A creature that eats but consumes less than half the required food for a day must succeed on a DC 10 Constitution saving throw or gain 1 Exhaustion level at the day's end. A creature that eats nothing for 5 days automatically gains 1 Exhaustion level at the end of the fifth day as well as an additional level at the end of each subsequent day without food. Exhaustion caused by malnutrition can't be removed until the creature eats the full amount of food required for a day."
  },
  "examples": [
    "Traveling through barren wasteland without sufficient rations",
    "Being imprisoned without adequate food",
    "Lost in wilderness unable to forage successfully",
    "Siege situation with dwindling food supplies",
    "Eating half rations to extend supplies (requires daily CON save)"
  ],
  "relatedConcepts": {
    "conditions": ["exhaustion"],
    "restTypes": ["long-rest"],
    "abilities": ["constitution"],
    "skills": ["survival"]
  }
}
