{
  "id": "hazard-suffocation",
  "name": "Suffocation",
  "description": "Creatures that run out of breath or are choking suffer exhaustion from lack of oxygen",
  "type": "environmental",
  "category": "asphyxiation",
  "trigger": "Running out of breath while underwater, being strangled, breathing toxic gas, or otherwise unable to breathe",
  "damage": null,
  "savingThrow": null,
  "duration": "ongoing until creature can breathe again",
  "breathHolding": {
    "duration": "1 + Constitution modifier minutes (minimum 30 seconds)",
    "note": "Creature can hold its breath before suffocation begins"
  },
  "effects": {
    "immediate": [],
    "ongoing": [
      "When out of breath or choking, gains 1 Exhaustion level at the end of each of its turns"
    ],
    "conditions": [
      "exhaustion"
    ]
  },
  "detection": {
    "difficulty": "automatic",
    "method": "awareness of inability to breathe"
  },
  "mitigation": [
    "Swim to surface if underwater",
    "Break free from choking/strangling effect",
    "Move to area with breathable air",
    "Use water breathing magic",
    "Have high Constitution modifier for longer breath-holding duration",
    "Creatures that don't need to breathe are immune"
  ],
  "recovery": {
    "immediate": "When a creature can breathe again, it removes all levels of Exhaustion it gained from suffocating",
    "note": "This is an exception to normal Exhaustion removal rules"
  },
  "srdReference": {
    "file": "dndsrd5.2_markdown/src/08_RulesGlossary.md",
    "section": "Suffocation [Hazard]",
    "lines": "1020-1022",
    "quote": "A creature can hold its breath for a number of minutes equal to 1 plus its Constitution modifier (minimum of 30 seconds) before suffocation begins. When a creature runs out of breath or is choking, it gains 1 Exhaustion level at the end of each of its turns. When a creature can breathe again, it removes all levels of Exhaustion it gained from suffocating."
  },
  "examples": [
    "Drowning underwater - Con modifier 2 means can hold breath 3 minutes",
    "Being strangled by a rope or creature",
    "Trapped in airless room or container",
    "Buried alive under debris or earth",
    "Inhaling thick smoke that prevents breathing",
    "Magic effect that removes air from area"
  ],
  "specialCases": [
    {
      "name": "Deep Water",
      "description": "After each hour swimming in deep water (100+ feet), creature without Swim Speed must succeed on DC 10 Constitution saving throw or gain 1 Exhaustion level (from pressure and cold, not suffocation)"
    },
    {
      "name": "Frigid Water",
      "description": "Creature can be immersed for minutes equal to Constitution score before ill effects, then DC 10 Constitution save each additional minute or gain 1 Exhaustion level"
    }
  ],
  "relatedConcepts": {
    "conditions": ["exhaustion"],
    "abilities": ["constitution"],
    "speeds": ["swim-speed"],
    "immunity": ["water-breathing", "no-need-to-breathe"]
  }
}
