{
  "name": "Proficiency",
  "type": "base",
  "img": "modules/foundry-core-srd-5e/assets/systems/proficiency.svg",
  "pages": [
    {
      "name": "Proficiency",
      "type": "text",
      "title": {
        "show": true,
        "level": 1
      },
      "text": {
        "format": 1,
        "content": "<h2>Proficiency</h2>\n\n<p><em>System for expertise and training</em></p>\n\n<p>Characters and monsters are good at various things. All creatures have a Proficiency Bonus, which reflects the impact that training has on the creature's capabilities.</p>\n\n<p>A character's Proficiency Bonus increases as the character gains levels. A monster's Proficiency Bonus is based on its Challenge Rating.</p>\n\n<h3>Proficiency Bonus Table</h3>\n<table>\n  <tr><th>Level or CR</th><th>Bonus</th></tr>\n  <tr><td>Up to 4</td><td>+2</td></tr>\n  <tr><td>5–8</td><td>+3</td></tr>\n  <tr><td>9–12</td><td>+4</td></tr>\n  <tr><td>13–16</td><td>+5</td></tr>\n  <tr><td>17–20</td><td>+6</td></tr>\n  <tr><td>21–24</td><td>+7</td></tr>\n  <tr><td>25–28</td><td>+8</td></tr>\n  <tr><td>29–30</td><td>+9</td></tr>\n</table>\n\n<p>This bonus is applied to a D20 Test when the creature has proficiency in a skill, in a saving throw, or with an item that the creature uses to make the D20 Test. The bonus is also used for spell attacks and for calculating the DC of saving throws for spells.</p>\n\n<h3>The Bonus Doesn't Stack</h3>\n<p>Your Proficiency Bonus can't be added to a die roll or another number more than once. For example, if a rule allows you to make a Charisma (Deception or Persuasion) check, you add your Proficiency Bonus if you're proficient in either skill, but you don't add it twice if you're proficient in both skills.</p>\n\n<p>Occasionally, a Proficiency Bonus might be multiplied or divided (doubled or halved, for example) before being added. For example, the Expertise feature doubles the Proficiency Bonus for certain ability checks. Whenever the bonus is used, it can be multiplied only once and divided only once.</p>\n\n<h3>Skill Proficiencies</h3>\n<p>Most ability checks involve using a skill, which represents a category of things creatures try to do with an ability check. If a creature is proficient in a skill, the creature applies its Proficiency Bonus to ability checks involving that skill. Without proficiency in a skill, a creature can still make ability checks involving that skill but doesn't add its Proficiency Bonus.</p>\n\n<p>The 18 skills are detailed in the Skills & Ability Checks system.</p>\n\n<h3>Saving Throw Proficiencies</h3>\n<p>Proficiency in a saving throw lets a character add their Proficiency Bonus to saves that use a particular ability. For example, proficiency in Wisdom saves lets you add your Proficiency Bonus to your Wisdom saves.</p>\n\n<p>Each class gives proficiency in at least two saving throws, representing that class's training in evading or resisting certain threats. Wizards, for example, are proficient in Intelligence and Wisdom saves; they train to resist mental assault.</p>\n\n<h3>Equipment Proficiencies</h3>\n<p>A character gains proficiency with various weapons and tools from their class and background. There are two categories of equipment proficiency:</p>\n\n<ul>\n  <li><strong>Weapon Proficiency:</strong> Anyone can use any weapon, but if you use a weapon you're proficient with, you add your Proficiency Bonus to attack rolls you make with it.</li>\n  <li><strong>Tool Proficiency:</strong> If you have proficiency with a tool, you add your Proficiency Bonus to any ability check you make that uses that tool.</li>\n</ul>\n\n<h3>Armor Proficiency</h3>\n<p>Anyone can don armor or wield a shield, but only those proficient in its use know how to wear it effectively. If you wear armor or wield a shield that you lack proficiency with, you have Disadvantage on any ability check, saving throw, or attack roll that involves Strength or Dexterity, and you can't cast spells.</p>"
      }
    }
  ],
  "flags": {
    "foundry-core-srd-5e": {
      "type": "system",
      "systemId": "srd-proficiency",
      "srd52": true
    }
  }
}