{
  "name": "Meld into Stone",
  "type": "spell",
  "img": "modules/foundry-core-srd-5e/assets/spells/meld-into-stone.png",
  "system": {
    "description": {
      "value": "<p><strong>Level 3</strong> Transmutation</p>\n<p><strong>Casting Time:</strong> 1 action</p>\n<p><strong>Range:</strong> undefined touch</p>\n<p><strong>Components:</strong> V, S</p>\n<p><strong>Duration:</strong> 8 hours</p>\n\nYou step into a stone object or surface large enough to fully contain your body, merging yourself and your equipment with the stone for the duration. You must touch the stone to do so. Nothing of your presence remains visible or otherwise detectable by nonmagical senses. While merged with the stone, you can't see what occurs outside it, and any Wisdom (Perception|XPHB) checks you make to hear sounds outside it are made with Disadvantage|XPHB. You remain aware of the passage of time and can cast spells on yourself while merged in the stone. You can use 5 feet of movement to leave the stone where you entered it, which ends the spell. You otherwise can't move. Minor physical damage to the stone doesn't harm you, but its partial destruction or a change in its shape (to the extent that you no longer fit within it) expels you and deals 6d6 Force damage to you. The stone's complete destruction (or transmutation into a different substance) expels you and deals 50 Force damage to you. If expelled, you move into an unoccupied space closest to where you first entered and have the Prone|XPHB condition.",
      "chat": "",
      "unidentified": ""
    },
    "source": "SRD 5.2.1",
    "activation": {
      "type": "action",
      "cost": 1,
      "condition": ""
    },
    "duration": {
      "value": 8,
      "units": "hour"
    },
    "target": {
      "value": null,
      "width": null,
      "units": "",
      "type": ""
    },
    "range": {
      "value": null,
      "long": null,
      "units": "ft"
    },
    "uses": {
      "value": null,
      "max": "",
      "per": null,
      "recovery": ""
    },
    "consume": {
      "type": "",
      "target": null,
      "amount": null
    },
    "ability": "",
    "actionType": "other",
    "attackBonus": "",
    "chatFlavor": "",
    "critical": {
      "threshold": null,
      "damage": ""
    },
    "damage": {
      "parts": [],
      "versatile": ""
    },
    "formula": "",
    "save": {
      "ability": "",
      "dc": null,
      "scaling": "spell"
    },
    "level": 3,
    "school": "trs",
    "components": {
      "value": "",
      "vocal": true,
      "somatic": true,
      "material": false,
      "ritual": true,
      "concentration": false
    },
    "materials": {
      "value": "",
      "consumed": false,
      "cost": 0,
      "supply": 0
    },
    "preparation": {
      "mode": "prepared",
      "prepared": false
    },
    "scaling": {
      "mode": "none",
      "formula": ""
    }
  },
  "flags": {
    "foundry-core-srd-5e": {
      "srdSource": "XPHB",
      "srd52": true,
      "page": 296,
      "school": "T",
      "classes": [],
      "_srdData": {
        "name": "Meld into Stone",
        "source": "XPHB",
        "page": 296,
        "srd52": true,
        "basicRules2024": true,
        "level": 3,
        "school": "T",
        "time": [
          {
            "number": 1,
            "unit": "action"
          }
        ],
        "range": {
          "type": "point",
          "distance": {
            "type": "touch"
          }
        },
        "components": {
          "v": true,
          "s": true
        },
        "duration": [
          {
            "type": "timed",
            "duration": {
              "type": "hour",
              "amount": 8
            }
          }
        ],
        "meta": {
          "ritual": true
        },
        "entries": [
          "You step into a stone object or surface large enough to fully contain your body, merging yourself and your equipment with the stone for the duration. You must touch the stone to do so. Nothing of your presence remains visible or otherwise detectable by nonmagical senses.",
          "While merged with the stone, you can't see what occurs outside it, and any Wisdom ({@skill Perception|XPHB}) checks you make to hear sounds outside it are made with {@variantrule Disadvantage|XPHB}. You remain aware of the passage of time and can cast spells on yourself while merged in the stone. You can use 5 feet of movement to leave the stone where you entered it, which ends the spell. You otherwise can't move.",
          "Minor physical damage to the stone doesn't harm you, but its partial destruction or a change in its shape (to the extent that you no longer fit within it) expels you and deals {@damage 6d6} Force damage to you. The stone's complete destruction (or transmutation into a different substance) expels you and deals 50 Force damage to you. If expelled, you move into an unoccupied space closest to where you first entered and have the {@condition Prone|XPHB} condition."
        ],
        "damageInflict": [
          "force"
        ],
        "conditionInflict": [
          "prone"
        ]
      }
    }
  }
}