{
  "name": "Tsunami",
  "type": "spell",
  "img": "modules/foundry-core-srd-5e/assets/spells/tsunami.png",
  "system": {
    "description": {
      "value": "<p><strong>Level 8</strong> Conjuration</p>\n<p><strong>Casting Time:</strong> 1 minute</p>\n<p><strong>Range:</strong> 1 miles</p>\n<p><strong>Components:</strong> V, S</p>\n<p><strong>Duration:</strong> Concentration, up to 6 rounds</p>\n\nA wall of water springs into existence at a point you choose within range. You can make the wall up to 300 feet long, 300 feet high, and 50 feet thick. The wall lasts for the duration. When the wall appears, each creature in its area makes a Strength saving throw, taking 6d10 Bludgeoning damage on a failed save or half as much damage on a successful one. At the start of each of your turns after the wall appears, the wall, along with any creatures in it, moves 50 feet away from you. Any Huge or smaller creature inside the wall or whose space the wall enters when it moves must succeed on a Strength saving throw or take 5d10 Bludgeoning damage. A creature can take this damage only once per round. At the end of the turn, the wall's height is reduced by 50 feet, and the damage the wall deals on later rounds is reduced by 1d10. When the wall reaches 0 feet in height, the spell ends. A creature caught in the wall can move by swimming. Because of the wave's force, though, the creature must succeed on a Strength (Athletics|XPHB) check against your spell save DC to move at all. If it fails the check, it can't move. A creature that moves out of the wall falls to the ground.",
      "chat": "",
      "unidentified": ""
    },
    "source": "SRD 5.2.1",
    "activation": {
      "type": "minute",
      "cost": 1,
      "condition": ""
    },
    "duration": {
      "value": 6,
      "units": "round"
    },
    "target": {
      "value": null,
      "width": null,
      "units": "",
      "type": ""
    },
    "range": {
      "value": 1,
      "long": null,
      "units": "mi"
    },
    "uses": {
      "value": null,
      "max": "",
      "per": null,
      "recovery": ""
    },
    "consume": {
      "type": "",
      "target": null,
      "amount": null
    },
    "ability": "",
    "actionType": "save",
    "attackBonus": "",
    "chatFlavor": "",
    "critical": {
      "threshold": null,
      "damage": ""
    },
    "damage": {
      "parts": [],
      "versatile": ""
    },
    "formula": "",
    "save": {
      "ability": "str",
      "dc": null,
      "scaling": "spell"
    },
    "level": 8,
    "school": "con",
    "components": {
      "value": "",
      "vocal": true,
      "somatic": true,
      "material": false,
      "ritual": false,
      "concentration": true
    },
    "materials": {
      "value": "",
      "consumed": false,
      "cost": 0,
      "supply": 0
    },
    "preparation": {
      "mode": "prepared",
      "prepared": false
    },
    "scaling": {
      "mode": "none",
      "formula": ""
    }
  },
  "flags": {
    "foundry-core-srd-5e": {
      "srdSource": "XPHB",
      "srd52": true,
      "page": 336,
      "school": "C",
      "classes": [],
      "_srdData": {
        "name": "Tsunami",
        "source": "XPHB",
        "page": 336,
        "srd52": true,
        "basicRules2024": true,
        "level": 8,
        "school": "C",
        "time": [
          {
            "number": 1,
            "unit": "minute"
          }
        ],
        "range": {
          "type": "point",
          "distance": {
            "type": "miles",
            "amount": 1
          }
        },
        "components": {
          "v": true,
          "s": true
        },
        "duration": [
          {
            "type": "timed",
            "duration": {
              "type": "round",
              "amount": 6
            },
            "concentration": true
          }
        ],
        "entries": [
          "A wall of water springs into existence at a point you choose within range. You can make the wall up to 300 feet long, 300 feet high, and 50 feet thick. The wall lasts for the duration.",
          "When the wall appears, each creature in its area makes a Strength saving throw, taking {@damage 6d10} Bludgeoning damage on a failed save or half as much damage on a successful one.",
          "At the start of each of your turns after the wall appears, the wall, along with any creatures in it, moves 50 feet away from you. Any Huge or smaller creature inside the wall or whose space the wall enters when it moves must succeed on a Strength saving throw or take {@damage 5d10} Bludgeoning damage. A creature can take this damage only once per round. At the end of the turn, the wall's height is reduced by 50 feet, and the damage the wall deals on later rounds is reduced by {@dice 1d10}. When the wall reaches 0 feet in height, the spell ends.",
          "A creature caught in the wall can move by swimming. Because of the wave's force, though, the creature must succeed on a Strength ({@skill Athletics|XPHB}) check against your spell save DC to move at all. If it fails the check, it can't move. A creature that moves out of the wall falls to the ground."
        ],
        "damageInflict": [
          "bludgeoning"
        ],
        "savingThrow": [
          "strength"
        ],
        "abilityCheck": [
          "strength"
        ],
        "areaTags": [
          "W"
        ]
      }
    }
  }
}